# CannotMaintainKeyReference Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..WallFailures..::..CannotMaintainKeyReference Property
BuiltInFailures..::..WallFailures Class See Also
---
Can't maintain the position of the Location Line in this Wall.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotMaintainKeyReference { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotMaintainKeyReference As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotMaintainKeyReference {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..WallFailures Class
Autodesk.Revit.DB Namespace